openwch/ch32x315/EVT/EXAM/SRC/Peripheral/src/ch32x3x5_dma.c
    if((DMAy_FLAG & DMA1_EXTEN_FLAG_Mask) == DMA1_EXTEN_FLAG_Mask)
    {
        tmpreg = DMA1_EXTEN->INTFR;
        tmpreg &= ~(0xFFFFF000);
    }
    else
    {
        tmpreg = DMA1->INTFR;
    }

    if((tmpreg & DMAy_FLAG) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return bitstatus;
}

/*********************************************************************
 * @fn      DMA_ClearFlag
 *
 * @brief   Clears the DMAy Channelx's pending flags.
 *
 * @param   DMAy_FLAG - specifies the flag to check.
 *            DMA1_FLAG_GL1 - DMA1 Channel1 global flag.
 *            DMA1_FLAG_TC1 - DMA1 Channel1 transfer complete flag.
 *            DMA1_FLAG_HT1 - DMA1 Channel1 half transfer flag.
 *            DMA1_FLAG_TE1 - DMA1 Channel1 transfer error flag.
 *            DMA1_FLAG_GL2 - DMA1 Channel2 global flag.
 *            DMA1_FLAG_TC2 - DMA1 Channel2 transfer complete flag.
 *            DMA1_FLAG_HT2 - DMA1 Channel2 half transfer flag.
 *            DMA1_FLAG_TE2 - DMA1 Channel2 transfer error flag.
 *            DMA1_FLAG_GL3 - DMA1 Channel3 global flag.
 *            DMA1_FLAG_TC3 - DMA1 Channel3 transfer complete flag.
 *            DMA1_FLAG_HT3 - DMA1 Channel3 half transfer flag.
 *            DMA1_FLAG_TE3 - DMA1 Channel3 transfer error flag.
 *            DMA1_FLAG_GL4 - DMA1 Channel4 global flag.
 *            DMA1_FLAG_TC4 - DMA1 Channel4 transfer complete flag.
 *            DMA1_FLAG_HT4 - DMA1 Channel4 half transfer flag.
 *            DMA1_FLAG_TE4 - DMA1 Channel4 transfer error flag.
 *            DMA1_FLAG_GL5 - DMA1 Channel5 global flag.
 *            DMA1_FLAG_TC5 - DMA1 Channel5 transfer complete flag.
 *            DMA1_FLAG_HT5 - DMA1 Channel5 half transfer flag.
 *            DMA1_FLAG_TE5 - DMA1 Channel5 transfer error flag.
 *            DMA1_FLAG_GL6 - DMA1 Channel6 global flag.
 *            DMA1_FLAG_TC6 - DMA1 Channel6 transfer complete flag.
 *            DMA1_FLAG_HT6 - DMA1 Channel6 half transfer flag.
 *            DMA1_FLAG_TE6 - DMA1 Channel6 transfer error flag.
 *            DMA1_FLAG_GL7 - DMA1 Channel7 global flag.
 *            DMA1_FLAG_TC7 - DMA1 Channel7 transfer complete flag.
 *            DMA1_FLAG_HT7 - DMA1 Channel7 half transfer flag.
 *            DMA1_FLAG_TE7 - DMA1 Channel7 transfer error flag.
 *            DMA1_FLAG_GL8 - DMA1 Channel8 global flag.
 *            DMA1_FLAG_TC8 - DMA1 Channel8 transfer complete flag.
 *            DMA1_FLAG_HT8 - DMA1 Channel8 half transfer flag.
 *            DMA1_FLAG_TE8 - DMA1 Channel8 transfer error flag.
 *            DMA1_FLAG_GL9 - DMA1 Channel9 global flag.
 *            DMA1_FLAG_TC9 - DMA1 Channel9 transfer complete flag.
 *            DMA1_FLAG_HT9 - DMA1 Channel9 half transfer flag.
 *            DMA1_FLAG_TE9 - DMA1 Channel9 transfer error flag.
 *            DMA1_FLAG_GL10 - DMA1 Channel10 global flag.
 *            DMA1_FLAG_TC10 - DMA1 Channel10 transfer complete flag.
 *            DMA1_FLAG_HT10 - DMA1 Channel10 half transfer flag.
 *            DMA1_FLAG_TE10 - DMA1 Channel10 transfer error flag.
 *            DMA1_FLAG_GL11 - DMA1 Channel11 global flag.
 *            DMA1_FLAG_TC11 - DMA1 Channel11 transfer complete flag.
 *            DMA1_FLAG_HT11 - DMA1 Channel11 half transfer flag.
 *            DMA1_FLAG_TE11 - DMA1 Channel11 transfer error flag.
 *
 * @return  none
 */
void DMA_ClearFlag(uint32_t DMAy_FLAG)
{
    if((DMAy_FLAG & DMA1_EXTEN_FLAG_Mask) == DMA1_EXTEN_FLAG_Mask)
    {
        DMA1_EXTEN->INTFCR = DMAy_FLAG;
    }
    else
    {
        DMA1->INTFCR = DMAy_FLAG;
    }
}

/*********************************************************************
 * @fn      DMA_GetITStatus
 *
 * @brief   Checks whether the specified DMAy Channelx interrupt has
 *        occurred or not.
 *
 * @param   DMAy_IT - specifies the DMAy interrupt source to check.
 *            DMA1_IT_GL1 - DMA1 Channel1 global flag.
 *            DMA1_IT_TC1 - DMA1 Channel1 transfer complete flag.
 *            DMA1_IT_HT1 - DMA1 Channel1 half transfer flag.
 *            DMA1_IT_TE1 - DMA1 Channel1 transfer error flag.
 *            DMA1_IT_GL2 - DMA1 Channel2 global flag.
 *            DMA1_IT_TC2 - DMA1 Channel2 transfer complete flag.
 *            DMA1_IT_HT2 - DMA1 Channel2 half transfer flag.
 *            DMA1_IT_TE2 - DMA1 Channel2 transfer error flag.
 *            DMA1_IT_GL3 - DMA1 Channel3 global flag.
 *            DMA1_IT_TC3 - DMA1 Channel3 transfer complete flag.
 *            DMA1_IT_HT3 - DMA1 Channel3 half transfer flag.
 *            DMA1_IT_TE3 - DMA1 Channel3 transfer error flag.
 *            DMA1_IT_GL4 - DMA1 Channel4 global flag.
 *            DMA1_IT_TC4 - DMA1 Channel4 transfer complete flag.
 *            DMA1_IT_HT4 - DMA1 Channel4 half transfer flag.
 *            DMA1_IT_TE4 - DMA1 Channel4 transfer error flag.
 *            DMA1_IT_GL5 - DMA1 Channel5 global flag.
 *            DMA1_IT_TC5 - DMA1 Channel5 transfer complete flag.
 *            DMA1_IT_HT5 - DMA1 Channel5 half transfer flag.
 *            DMA1_IT_TE5 - DMA1 Channel5 transfer error flag.
 *            DMA1_IT_GL6 - DMA1 Channel6 global flag.
 *            DMA1_IT_TC6 - DMA1 Channel6 transfer complete flag.
 *            DMA1_IT_HT6 - DMA1 Channel6 half transfer flag.
 *            DMA1_IT_TE6 - DMA1 Channel6 transfer error flag.
 *            DMA1_IT_GL7 - DMA1 Channel7 global flag.
 *            DMA1_IT_TC7 - DMA1 Channel7 transfer complete flag.
 *            DMA1_IT_HT7 - DMA1 Channel7 half transfer flag.
 *            DMA1_IT_TE7 - DMA1 Channel7 transfer error flag.
 *            DMA1_IT_GL8 - DMA1 Channel8 global flag.
 *            DMA1_IT_TC8 - DMA1 Channel8 transfer complete flag.
 *            DMA1_IT_HT8 - DMA1 Channel8 half transfer flag.
 *            DMA1_IT_TE8 - DMA1 Channel8 transfer error flag.
 *            DMA1_IT_GL9 - DMA1 Channel9 global flag.
 *            DMA1_IT_TC9 - DMA1 Channel9 transfer complete flag.
 *            DMA1_IT_HT9 - DMA1 Channel9 half transfer flag.
 *            DMA1_IT_TE9 - DMA1 Channel9 transfer error flag.
 *            DMA1_IT_GL10 - DMA1 Channel10 global flag.
 *            DMA1_IT_TC10 - DMA1 Channel10 transfer complete flag.
 *            DMA1_IT_HT10 - DMA1 Channel10 half transfer flag.
 *            DMA1_IT_TE10 - DMA1 Channel10 transfer error flag.
 *            DMA1_IT_GL11 - DMA1 Channel11 global flag.
 *            DMA1_IT_TC11 - DMA1 Channel11 transfer complete flag.
 *            DMA1_IT_HT11 - DMA1 Channel11 half transfer flag.
 *            DMA1_IT_TE11 - DMA1 Channel11 transfer error flag.
 *
 * @return  The new state of DMAy_IT (SET or RESET).
 */
ITStatus DMA_GetITStatus(uint32_t DMAy_IT)
{
    ITStatus bitstatus = RESET;
    uint32_t tmpreg = 0;

    if((DMAy_IT & DMA1_EXTEN_FLAG_Mask) == DMA1_EXTEN_FLAG_Mask)
    {
        tmpreg = DMA1_EXTEN->INTFR;
        tmpreg &= ~(0xFFFFF000);
    }
    else
    {
        tmpreg = DMA1->INTFR;
    }

    if((tmpreg & DMAy_IT) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/*********************************************************************
 * @fn      DMA_ClearITPendingBit
 *
 * @brief   Clears the DMAy Channelx's interrupt pending bits.
 *
 * @param   DMAy_IT - specifies the DMAy interrupt source to check.
 *            DMA1_IT_GL1 - DMA1 Channel1 global flag.
 *            DMA1_IT_TC1 - DMA1 Channel1 transfer complete flag.
 *            DMA1_IT_HT1 - DMA1 Channel1 half transfer flag.
 *            DMA1_IT_TE1 - DMA1 Channel1 transfer error flag.
 *            DMA1_IT_GL2 - DMA1 Channel2 global flag.
 *            DMA1_IT_TC2 - DMA1 Channel2 transfer complete flag.
 *            DMA1_IT_HT2 - DMA1 Channel2 half transfer flag.
 *            DMA1_IT_TE2 - DMA1 Channel2 transfer error flag.
 *            DMA1_IT_GL3 - DMA1 Channel3 global flag.
 *            DMA1_IT_TC3 - DMA1 Channel3 transfer complete flag.
 *            DMA1_IT_HT3 - DMA1 Channel3 half transfer flag.
 *            DMA1_IT_TE3 - DMA1 Channel3 transfer error flag.
 *            DMA1_IT_GL4 - DMA1 Channel4 global flag.
 *            DMA1_IT_TC4 - DMA1 Channel4 transfer complete flag.
 *            DMA1_IT_HT4 - DMA1 Channel4 half transfer flag.
 *            DMA1_IT_TE4 - DMA1 Channel4 transfer error flag.
 *            DMA1_IT_GL5 - DMA1 Channel5 global flag.
 *            DMA1_IT_TC5 - DMA1 Channel5 transfer complete flag.
 *            DMA1_IT_HT5 - DMA1 Channel5 half transfer flag.
 *            DMA1_IT_TE5 - DMA1 Channel5 transfer error flag.
 *            DMA1_IT_GL6 - DMA1 Channel6 global flag.
 *            DMA1_IT_TC6 - DMA1 Channel6 transfer complete flag.
 *            DMA1_IT_HT6 - DMA1 Channel6 half transfer flag.
 *            DMA1_IT_TE6 - DMA1 Channel6 transfer error flag.
 *            DMA1_IT_GL7 - DMA1 Channel7 global flag.
 *            DMA1_IT_TC7 - DMA1 Channel7 transfer complete flag.
 *            DMA1_IT_HT7 - DMA1 Channel7 half transfer flag.
 *            DMA1_IT_TE7 - DMA1 Channel7 transfer error flag.
 *            DMA1_IT_GL8 - DMA1 Channel8 global flag.
 *            DMA1_IT_TC8 - DMA1 Channel8 transfer complete flag.
 *            DMA1_IT_HT8 - DMA1 Channel8 half transfer flag.
 *            DMA1_IT_TE8 - DMA1 Channel8 transfer error flag.
 *            DMA1_IT_GL9 - DMA1 Channel9 global flag.
 *            DMA1_IT_TC9 - DMA1 Channel9 transfer complete flag.
 *            DMA1_IT_HT9 - DMA1 Channel9 half transfer flag.
 *            DMA1_IT_TE9 - DMA1 Channel9 transfer error flag.
 *            DMA1_IT_GL10 - DMA1 Channel10 global flag.
 *            DMA1_IT_TC10 - DMA1 Channel10 transfer complete flag.
 *            DMA1_IT_HT10 - DMA1 Channel10 half transfer flag.
 *            DMA1_IT_TE10 - DMA1 Channel10 transfer error flag.
 *            DMA1_IT_GL11 - DMA1 Channel11 global flag.
 *            DMA1_IT_TC11 - DMA1 Channel11 transfer complete flag.
 *            DMA1_IT_HT11 - DMA1 Channel11 half transfer flag.
 *            DMA1_IT_TE11 - DMA1 Channel11 transfer error flag.
 *
 * @return  none
 */
void DMA_ClearITPendingBit(uint32_t DMAy_IT)
{
    if((DMAy_IT & DMA1_EXTEN_FLAG_Mask) == DMA1_EXTEN_FLAG_Mask)
    {
        DMA1_EXTEN->INTFCR = DMAy_IT;
    }
    else
    {
        DMA1->INTFCR = DMAy_IT;
    }
}

/*********************************************************************
 * @fn      DMA_RemapChannel_Config
 *
 * @brief   Changes the mapping of the specified DMA channel.
 *
 * @param   DMA_Remap - selects the pin to remap.
 *            DMA_RemapCH_SPI1 - SPI1 Alternate Function mapping DMA channel.
 *            DMA_RemapCH_SPI2 - SPI2 Alternate Function mapping DMA channel.
 *            DMA_RemapCH_SPI3 - SPI3 Alternate Function mapping DMA channel. 
 *            DMA_RemapCH_USART1 - USART1 Alternate Function mapping DMA channel.
 *            DMA_RemapCH_USART2 - USART2 Alternate Function mapping DMA channel.
 *            DMA_RemapCH_USART3 - USART3 Alternate Function mapping DMA channel.
 *            DMA_RemapCH_USART4 - USART4 Alternate Function mapping DMA channel.
 *            DMA_RemapCH_I2C2 - I2C2 Alternate Function mapping DMA channel.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void DMA_RemapChannel_Config(uint16_t DMA_Remap, FunctionalState NewState)
{
    if(NewState)
    {
        EXTEN->EXTEN_CTR |= DMA_Remap;
    }
    else
    {
        EXTEN->EXTEN_CTR &= ~DMA_Remap;
    }
}

/*********************************************************************
 * @fn      DMA_GetDoubleBufferMemoryFlag
 *
 * @brief   Get the DMAy Channelx DoubleBuffer memory flag
 *
 * @param   DMAy_Channelx - here y can be 1 to select the DMA and x can be
 *        1 to 11 for DMA1 to select the DMA Channel.
 *  
 * @return  DMA_DoubleBufferMode_Memory_0/1
 */
uint32_t DMA_GetDoubleBufferMemoryFlag(DMA_Channel_TypeDef* DMAy_Channelx)
{
    uint32_t tmpreg = 0;
    tmpreg = ((DMAy_Channelx->CFGR) & 0x10000);
    if(tmpreg == DMA_DoubleBufferMode_Memory_1)
    {
        return DMA_DoubleBufferMode_Memory_1;
    }
    else 
    {
        return DMA_DoubleBufferMode_Memory_0;        
    }

}
